Documents/ЛБ_УстановкаНастроекЗаймаВерхнегоУровня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановкаНастроекЗаймаВерхнегоУровня</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_НастройкиЗаймаВерхнегоУровня</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьПроцентыЗаДеньЗалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНачислятьПроцентыЗаПоследнийДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьСуммуПроценты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругленияПроценты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторонуПроценты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОкругленияСуммыПроцентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОкругленияСуммыПроцентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьСуммуОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругленияОценка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторонуОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчитатьПроцентыДеньВыдачиРавенДеньВыкупа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкиЗаймаВерхнегоУровня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкиЗаймаВерхнегоУровня</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачислятьПроцентыЗаДеньЗалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеНачислятьПроцентыЗаПоследнийДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьСуммуПроценты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОкругленияПроценты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьВБольшуюСторонуПроценты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОкругленияСуммыПроцентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОкругленияСуммыПроцентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьСуммуОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОкругленияОценка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьВБольшуюСторонуОценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчитатьПроцентыДеньВыдачиРавенДеньВыкупа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_УстановкаНастроекЗаймаВерхнегоУровня/Ext/ObjectModule.bsl
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.ЛБ_НастройкиЗаймаВерхнегоУровня.Записывать = Истина;
	Движение = Движения.ЛБ_НастройкиЗаймаВерхнегоУровня.Добавить();
	Движение.Период = Дата;
    Движение.Организация = Организация; 
	Движение.ОкруглятьСуммуПроценты = ОкруглятьСуммуПроценты;
	Движение.ВидОкругленияСуммыПроцентов = ВидОкругленияСуммыПроцентов;	    
	Движение.ПорядокОкругленияПроценты = ПорядокОкругленияПроценты;
	Движение.ОкруглятьВБольшуюСторонуПроценты = ОкруглятьВБольшуюСторонуПроценты;	
	Движение.ОкруглятьСуммуОценка = ОкруглятьСуммуОценка;
	Движение.ПорядокОкругленияОценка = ПорядокОкругленияОценка;
	Движение.ОкруглятьВБольшуюСторонуОценка	= ОкруглятьВБольшуюСторонуОценка;
	Движение.СчитатьПроцентыДеньВыдачиРавенДеньВыкупа = СчитатьПроцентыДеньВыдачиРавенДеньВыкупа;
	Движение.НачислятьПроцентыЗаДеньЗалога = НачислятьПроцентыЗаДеньЗалога;
	Движение.НеНачислятьПроцентыЗаПоследнийДень = НеНачислятьПроцентыЗаПоследнийДень;

КонецПроцедуры
